rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 7]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "No body"]]
---
  def same_director
    @movie = Movie.find(params[:id])
    if @movie && @movie.director.present?